Revit 2024 API
ReinforcementRoundingManager.GetLengthUnitTypeId Method
 Gets the identifier of the length unit quantifying the reinforcement rounding values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ForgeTypeId GetLengthUnitTypeId()
Visual Basic
Public Function GetLengthUnitTypeId As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetLengthUnitTypeId()
See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace